app/Controllers/Api/Banners.php

SELECT *
FROM `banners`
ORDER BY `created_at` DESC
---
    public function index() {
        $model = new BannerModel();
        $banners = $model->orderBy('created_at', 'DESC')->findAll();