app/Controllers/Api/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'lema'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        if (!$username || !$password) {
            return $this->responseHasil(400, false, 'Username dan password harus diisi');
        }

        $model = new UserModel();
        $user  = $model->where('username', $username)->first();