app/Controllers/Api/Orders.php

SELECT *
FROM `orders`
WHERE `user_id` = '4'
ORDER BY `id` DESC
---
    public function index() {
        $model = new OrderModel();
        $userId = $this->request->getGet('user_id');

        if (!$userId) {
            return $this->fail('Parameter user_id dibutuhkan', 400);
        }

        $orders = $model->where('user_id', $userId)->orderBy('id', 'DESC')->findAll();

INSERT INTO `orders` (`user_id`, `service_name`, `fullname`, `whatsapp`, `address`, `pickup_time`, `notes`, `resi_code`, `status`, `payment_method`, `total_price`, `created_at`, `updated_at`) VALUES ('4', 'Cuci Kering', 'hola', '08987421122', 'kemiren', '19.00', '', 'TRX-8A86F', 'Pending', 'Transfer', '0', '2026-06-24 05:36:00', '2026-06-24 05:36:00')
---
    public function create() {
        $model = new OrderModel();

        $resi = 'TRX-' . strtoupper(substr(md5(uniqid()), 0, 5));

        $data = [
            'user_id'        => $this->request->getVar('user_id'),
            'service_name'   => $this->request->getVar('service_name'),
            'fullname'       => $this->request->getVar('fullname'),
            'whatsapp'       => $this->request->getVar('whatsapp'),
            'address'        => $this->request->getVar('address'),
            'pickup_time'    => $this->request->getVar('pickup_time'),
            'notes'          => $this->request->getVar('notes'),
            'resi_code'      => $resi,
            'status'         => 'Pending',
            'payment_method' => $this->request->getVar('payment_method'),
            'total_price'    => $this->request->getVar('total_price') ?? 0,
        ];

        if ($model->insert($data)) {

SELECT *
FROM `orders`
WHERE `resi_code` = 'TRX-8A86F'
 LIMIT 1
---
    public function show($resi = null) {
        $model = new OrderModel();
        $order = $model->where('resi_code', strtoupper($resi))->first();