app/Controllers/Api/RegistrasiController.php

SELECT *
FROM `users`
WHERE `username` = 'testuser'
 LIMIT 1
INSERT INTO `users` (`username`, `fullname`, `password`, `role`, `profile_image`) VALUES ('testuser', 'Annisa Nur Amelia', '$2y$10$Zugnnmrq1OyzBar0zZfu7Ob2rk4cLaSMtspq4w9GvyFYZ1rD1rMdK', 'user', 'default.png')
---
    public function registrasi()
    {
        $username = $this->request->getVar('username');
        $fullname = $this->request->getVar('fullname');
        $password = $this->request->getVar('password');

        if (!$username || !$fullname || !$password) {
            return $this->responseHasil(400, false, 'Semua field harus diisi');
        }

        $model = new UserModel();
        $cek   = $model->where('username', $username)->first();
        if ($cek) {
            return $this->responseHasil(400, false, 'Username sudah digunakan');
        }

        $model->save([
            'username'      => $username,
            'fullname'      => $fullname,
            'password'      => password_hash($password, PASSWORD_DEFAULT),
            'role'          => 'user',
            'profile_image' => 'default.png',
        ]);