app/Controllers/Api/Services.php

    public function index() {
        $db = \Config\Database::connect();
        $settings = $db->table('settings')->get()->getFirstRow('array');
---
SELECT *
FROM `settings`