app/Controllers/Api/UserController.php

    private function getUserFromToken()
    {
        $authHeader = $this->request->getHeaderLine('Authorization');
        if (!$authHeader) return null;

        $token      = str_replace('Bearer ', '', $authHeader);
        $tokenModel = new MUserToken();
        $tokenData  = $tokenModel->where('auth_key', $token)->first();
        if (!$tokenData) return null;

        $userModel = new UserModel();
        return $userModel->find($tokenData['user_id']);
---
SELECT *
FROM `user_token`
WHERE `auth_key` = '2T0SpzcGS3kFOkeDJ2qJV9PaxCTcYJSFpImPw4YFtIE8AZCxT9dDalOeFCdzMXRRRdqHr3oX3tYaGPIlGjRRmk0ElFq0z1OSuY4K'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function updateProfile()
    {
        $user = $this->getUserFromToken();
        if (!$user) {
            return $this->responseHasil(401, false, 'Token tidak valid');
        }

        $data = [];
        if ($this->request->getVar('fullname'))
            $data['fullname'] = $this->request->getVar('fullname');
        if ($this->request->getVar('phone'))
            $data['phone']    = $this->request->getVar('phone');
        if ($this->request->getVar('address'))
            $data['address']  = $this->request->getVar('address');

        // Handle File Upload untuk Profile Image
        $fileImage = $this->request->getFile('profile_image');
        if ($fileImage && $fileImage->isValid() && !$fileImage->hasMoved()) {
            $newName = $fileImage->getRandomName();
            $fileImage->move('assets/img/profile', $newName);
            $data['profile_image'] = $newName;
        }

        if (empty($data)) {
            return $this->responseHasil(400, false, 'Tidak ada data yang diupdate');
        }

        $userModel = new UserModel();
        $userModel->update($user['id'], $data);

        $updatedUser = $userModel->find($user['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'