app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Proses'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Selesai'
SELECT SUM(`total_price`) AS `total_price`
FROM `orders`
WHERE `status` = 'Selesai'
SELECT *
FROM `orders`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard() {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }
        $orderModel = new OrderModel();
        $data = [
            'count_pending' => $orderModel->where('status', 'Pending')->countAllResults(),
            'count_proses'  => $orderModel->where('status', 'Proses')->countAllResults(),
            'count_selesai' => $orderModel->where('status', 'Selesai')->countAllResults(),
            'income'        => $orderModel->where('status', 'Selesai')->selectSum('total_price')->get()->getRow()->total_price,
            'latest_orders' => $orderModel->orderBy('created_at', 'DESC')->findAll(5)

SELECT *
FROM `orders`
ORDER BY `created_at` DESC
---
    public function orders() {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `orders`
WHERE `orders`.`id` = '8'
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1
---
    public function order_detail($id) {
    if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
        return redirect()->to('/login');
    }

    $orderModel = new \App\Models\OrderModel();
    $settingsModel = new \App\Models\SettingsModel();

    $data['order'] = $orderModel->find($id);

    $data['settings'] = $settingsModel->find(1);

SELECT *
FROM `settings`
WHERE `settings`.`id` = 1
SELECT *
FROM `banners`
ORDER BY `created_at` DESC
---
    public function settings()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }

        $settingsModel = new \App\Models\SettingsModel();
        $bannerModel = new \App\Models\BannerModel();

        // Ambil data settings (ID 1)
        $data['settings'] = $settingsModel->find(1);
        $data['banners'] = $bannerModel->orderBy('created_at', 'DESC')->findAll();